# Задача №1
# Создай строку, которая содержит твоё имя (или любое другое слово, если не хочешь использовать имя). Выведи эту строку на экран.
name = "Kirill"
print(name)

# Задача №2
# Создай строку "Hello". Выведи на экран первый символ этой строки.
result = "Hello"
result_0 = result[0]
print(result_0)

# Задача №3
# Создай строку "Python". Используя срез, выведи на экран последние три символа этой строки.
name = "Python"
result = name[-3:]
print(result)
